# SQL Queries: Navigating a database

## Setup

We are now installing the necessary packages to interact with the MySQL database and issue SQL queries using the notebook.

In [0]:
!apt-get install python3-mysqldb
!pip3 install -U sqlalchemy sql_magic

In [0]:
%reload_ext sql_magic

In [0]:
from sqlalchemy import create_engine

conn_string = 'mysql://{user}:{password}@{host}/?charset=utf8'.format(
    host = 'db.ipeirotis.org', 
    user = 'student',
    password = 'dwdstudent2015',
    encoding = 'utf-8')
engine = create_engine(conn_string)

In [0]:
%config SQL.conn_name = 'engine'

## Navigation Queries

In [5]:
%%read_sql
show databases

Query started at 10:50:03 PM UTC; Query executed in 0.00 m

             Database
0  information_schema
1        bike_sharing
2            citibike
3   citibike_fall2017
4            facebook
5                imdb
6               music
7     nypd_complaints
8              public

In [6]:
%%read_sql
use imdb

Query started at 10:50:03 PM UTC; Query executed in 0.00 m

In [7]:
%%read_sql
show tables

Query started at 10:50:03 PM UTC; Query executed in 0.00 m

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [8]:
%%read_sql
describe actors

Query started at 10:50:03 PM UTC; Query executed in 0.00 m

        Field          Type Null  Key Default Extra
0          id       int(11)   NO  PRI       0
1  first_name  varchar(100)  YES  MUL    None
2   last_name  varchar(100)  YES  MUL    None
3      gender       char(1)  YES         None

In [9]:
%%read_sql
describe roles

Query started at 10:50:03 PM UTC; Query executed in 0.00 m

      Field          Type Null  Key Default Extra
0  actor_id       int(11)  YES  MUL    None
1  movie_id       int(11)  YES  MUL    None
2      role  varchar(100)  YES  MUL    None